[Survived] ConditionalExpression
apps/api/lib/macroTargetParams.ts:11:9
-       if (!raw.length) continue;
+       if (false) continue;
Tests ran:
    GET /api/restaurants — unentitled callers returns 200 with locked: true and no Authorization header
    GET /api/restaurants — unentitled callers strips bestMatch on every row when authenticated but not subscribed
    GET /api/restaurants — success returns 200 with data and locked: false when authenticated and entitled
  and 25 more tests!
