[NoCoverage] StringLiteral
apps/api/services/chainServing.ts:10:95
-     const candidates = brands.filter(b => ["high", "llm-confirmed"].includes(b.detectionConf ?? "") && b.menuKind === "restaurant"
+     const candidates = brands.filter(b => ["high", "llm-confirmed"].includes(b.detectionConf ?? "Stryker was here!") && b.menuKind === "restaurant"

[NoCoverage] ArrayDeclaration
apps/api/services/chainServing.ts:35:69
-     const fallback = unresolved.length ? await estimate(unresolved) : [];
+     const fallback = unresolved.length ? await estimate(unresolved) : ["Stryker was here"];

[Survived] MethodExpression
apps/api/services/chainServing.ts:7:37
-   const brandName = (name: string) => name.normalize("NFKC").toLowerCase().replace(/[^\p{L}\p{N}]+/gu, " ").trim();
+   const brandName = (name: string) => name.normalize("NFKC").toUpperCase().replace(/[^\p{L}\p{N}]+/gu, " ").trim();
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] MethodExpression
apps/api/services/chainServing.ts:7:37
-   const brandName = (name: string) => name.normalize("NFKC").toLowerCase().replace(/[^\p{L}\p{N}]+/gu, " ").trim();
+   const brandName = (name: string) => name.normalize("NFKC").toLowerCase().replace(/[^\p{L}\p{N}]+/gu, " ");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] StringLiteral
apps/api/services/chainServing.ts:7:102
-   const brandName = (name: string) => name.normalize("NFKC").toLowerCase().replace(/[^\p{L}\p{N}]+/gu, " ").trim();
+   const brandName = (name: string) => name.normalize("NFKC").toLowerCase().replace(/[^\p{L}\p{N}]+/gu, "").trim();
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] Regex
apps/api/services/chainServing.ts:9:50
-     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
+     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*/, "").split(/\s+-\s+/)[0]!);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] Regex
apps/api/services/chainServing.ts:9:50
-     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
+     const name = brandName(restaurant.name.replace(/\s\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] Regex
apps/api/services/chainServing.ts:9:50
-     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
+     const name = brandName(restaurant.name.replace(/\S*\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] Regex
apps/api/services/chainServing.ts:9:50
-     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
+     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\S*$/, "").split(/\s+-\s+/)[0]!);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] Regex
apps/api/services/chainServing.ts:9:81
-     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
+     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s-\s+/)[0]!);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] Regex
apps/api/services/chainServing.ts:9:81
-     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s+-\s+/)[0]!);
+     const name = brandName(restaurant.name.replace(/\s*\([^()]+\)\s*$/, "").split(/\s+-\s/)[0]!);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] StringLiteral
apps/api/services/chainServing.ts:10:50
-     const candidates = brands.filter(b => ["high", "llm-confirmed"].includes(b.detectionConf ?? "") && b.menuKind === "restaurant"
+     const candidates = brands.filter(b => ["high", ""].includes(b.detectionConf ?? "") && b.menuKind === "restaurant"
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
    brand handoff accepts verified exact identity and location suffixes, rejects conflicts and near names

[Survived] ArrayDeclaration
apps/api/services/chainServing.ts:16:149
-     return { calories: row.calories, proteinG: row.proteinG, carbsG: row.carbsG, fatG: row.fatG, confidence: "HIGH", source: "official", dietaryTags: [],
+     return { calories: row.calories, proteinG: row.proteinG, carbsG: row.carbsG, fatG: row.fatG, confidence: "HIGH", source: "official", dietaryTags: ["Stryker was here"],
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:21:46
-     const brands = await prisma.brand.findMany({ where: { detectionConf: { in: ["high", "llm-confirmed"] }, menuKind: "restaurant" } });
+     const brands = await prisma.brand.findMany({});
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:21:55
-     const brands = await prisma.brand.findMany({ where: { detectionConf: { in: ["high", "llm-confirmed"] }, menuKind: "restaurant" } });
+     const brands = await prisma.brand.findMany({ where: {} });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:21:72
-     const brands = await prisma.brand.findMany({ where: { detectionConf: { in: ["high", "llm-confirmed"] }, menuKind: "restaurant" } });
+     const brands = await prisma.brand.findMany({ where: { detectionConf: {}, menuKind: "restaurant" } });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] StringLiteral
apps/api/services/chainServing.ts:21:87
-     const brands = await prisma.brand.findMany({ where: { detectionConf: { in: ["high", "llm-confirmed"] }, menuKind: "restaurant" } });
+     const brands = await prisma.brand.findMany({ where: { detectionConf: { in: ["high", ""] }, menuKind: "restaurant" } });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:22:48
-     const rows = await prisma.chainItem.findMany({ where: { brandId: { in: brands.map(b => b.id) } } });
+     const rows = await prisma.chainItem.findMany({});
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:22:57
-     const rows = await prisma.chainItem.findMany({ where: { brandId: { in: brands.map(b => b.id) } } });
+     const rows = await prisma.chainItem.findMany({ where: {} });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:22:68
-     const rows = await prisma.chainItem.findMany({ where: { brandId: { in: brands.map(b => b.id) } } });
+     const rows = await prisma.chainItem.findMany({ where: { brandId: {} } });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] StringLiteral
apps/api/services/chainServing.ts:50:23
-       await tx.$queryRaw`SELECT id FROM "ChainItem" WHERE id = ${approved.id} FOR SHARE`;
+       await tx.$queryRaw``;
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] OptionalChaining
apps/api/services/chainServing.ts:52:21
-       if (!current || approvedChainRow(current)?.review.dataHash !== approved.review.dataHash) throw new Error("Chain review changed; rebuild the plan");
+       if (!current || approvedChainRow(current).review.dataHash !== approved.review.dataHash) throw new Error("Chain review changed; rebuild the plan");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:55:9
-       if (!restaurant || !brand || verifiedBrand(restaurant, [brand]) !== approved.brandId) throw new Error("Restaurant brand identity changed");
+       if (false || verifiedBrand(restaurant, [brand]) !== approved.brandId) throw new Error("Restaurant brand identity changed");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] LogicalOperator
apps/api/services/chainServing.ts:55:9
-       if (!restaurant || !brand || verifiedBrand(restaurant, [brand]) !== approved.brandId) throw new Error("Restaurant brand identity changed");
+       if (!restaurant && !brand || verifiedBrand(restaurant, [brand]) !== approved.brandId) throw new Error("Restaurant brand identity changed");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:56:49
-       const catalog = await tx.chainItem.findMany({ where: { brandId: approved.brandId } });
+       const catalog = await tx.chainItem.findMany({});
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:56:58
-       const catalog = await tx.chainItem.findMany({ where: { brandId: approved.brandId } });
+       const catalog = await tx.chainItem.findMany({ where: {} });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] OptionalChaining
apps/api/services/chainServing.ts:57:83
-       const item = aprilMenuIdentity(expected), result = buildChainMatcher(catalog)(restaurant?.brandId ?? undefined, item);
+       const item = aprilMenuIdentity(expected), result = buildChainMatcher(catalog)(restaurant.brandId ?? undefined, item);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:58:40
-       if (result.status !== "matched" || result.row.id !== approved.id || result.row.review.dataHash !== approved.review.dataHash) throw new Error("April item has no current reviewed binding");
+       if (result.status !== "matched" || false || result.row.review.dataHash !== approved.review.dataHash) throw new Error("April item has no current reviewed binding");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:58:73
-       if (result.status !== "matched" || result.row.id !== approved.id || result.row.review.dataHash !== approved.review.dataHash) throw new Error("April item has no current reviewed binding");
+       if (result.status !== "matched" || result.row.id !== approved.id || false) throw new Error("April item has no current reviewed binding");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:63:83
-       if (!actual || actual.updatedAt.getTime() !== expected.updatedAt.getTime() || chainMenuFingerprint(aprilMenuIdentity({ ...expected, ...actual })) !== chainMenuFingerprint(item)) throw new Error("April item changed; rebuild the plan");
+       if (!actual || actual.updatedAt.getTime() !== expected.updatedAt.getTime() || false) throw new Error("April item changed; rebuild the plan");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:67:102
-       const estimates = await tx.macroEstimate.findMany({ where: { menuItemId: expected.id }, orderBy: { id: "asc" } });
+       const estimates = await tx.macroEstimate.findMany({ where: { menuItemId: expected.id }, orderBy: {} });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:68:36
-       if (expected.macroEstimates && JSON.stringify(estimates) !== JSON.stringify(expected.macroEstimates)) throw new Error("April estimates changed; rebuild the backup and plan");
+       if (expected.macroEstimates && true) throw new Error("April estimates changed; rebuild the backup and plan");
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] LogicalOperator
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null || ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = true && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] LogicalOperator
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto || existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = true && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] LogicalOperator
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" || !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = true && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] LogicalOperator
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning || existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = true && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] OptionalChaining
apps/api/services/chainServing.ts:70:23
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:70:66
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && true && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:70:122
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && true && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
