[Survived] MethodExpression
apps/api/services/chainServing.ts:70:163
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].some(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ArrayDeclaration
apps/api/services/chainServing.ts:70:163
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && [].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] StringLiteral
apps/api/services/chainServing.ts:70:164
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] StringLiteral
apps/api/services/chainServing.ts:70:176
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] StringLiteral
apps/api/services/chainServing.ts:70:188
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] StringLiteral
apps/api/services/chainServing.ts:70:198
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", ""].every(key => existing[key as "calories"] === macro[key as "calories"]);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ConditionalExpression
apps/api/services/chainServing.ts:70:219
-       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => existing[key as "calories"] === macro[key as "calories"]);
+       const unchanged = existing?.reasoning === macro.reasoning && existing.confidence === "HIGH" && !existing.hadPhoto && existing.ingredientBreakdown === null && ["calories", "proteinG", "carbsG", "fatG"].every(key => true);
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:76:99
-       return tx.menuItem.findUniqueOrThrow({ where: { id: expected.id }, include: { macroEstimates: { orderBy: { id: "asc" } } } });
+       return tx.menuItem.findUniqueOrThrow({ where: { id: expected.id }, include: { macroEstimates: {} } });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:76:110
-       return tx.menuItem.findUniqueOrThrow({ where: { id: expected.id }, include: { macroEstimates: { orderBy: { id: "asc" } } } });
+       return tx.menuItem.findUniqueOrThrow({ where: { id: expected.id }, include: { macroEstimates: { orderBy: {} } } });
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts

[Survived] ObjectLiteral
apps/api/services/chainServing.ts:77:6
-     }, { isolationLevel: Prisma.TransactionIsolationLevel.Serializable, timeout: 30_000 });
+     }, {});
Tests ran:
    reviewed chains through April and real new-hex persistence waba-grill: captured April identity and new UE location serve the same PDF facts
    reviewed chains through April and real new-hex persistence yoshinoya: captured April identity and new UE location serve the same PDF facts
