[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:23:111
-       const found = brands.filter(b => b.slug === slug && ["high", "llm-confirmed"].includes(b.detectionConf ?? "") && b.menuKind === "restaurant");
+       const found = brands.filter(b => b.slug === slug && ["high", "llm-confirmed"].includes(b.detectionConf ?? "Stryker was here!") && b.menuKind === "restaurant");

[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:24:45
-       if (found.length !== 1) throw new Error(`Verified brand missing or ambiguous: ${slug}`);
+       if (found.length !== 1) throw new Error(``);

[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:39:64
-       if (!approvedChainRow({ ...row, review })) throw new Error(`Invalid reviewed facts: ${definition.canonicalKey}`);
+       if (!approvedChainRow({ ...row, review })) throw new Error(``);

[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:45:34
-       if (!before) throw new Error(`Quarantined row missing: ${definition.canonicalKey}`);
+       if (!before) throw new Error(``);

[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:60:74
-         if (match(row.brandId, item).status !== "matched") throw new Error(`Ambiguous reviewed alias: ${alias.name}`);
+         if (match(row.brandId, item).status !== "matched") throw new Error(``);

[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:72:91
-       if (planChainPilot(brands, currentCatalog, pilot).hash !== plan.hash) throw new Error("Catalog or curated definition changed after planning");
+       if (planChainPilot(brands, currentCatalog, pilot).hash !== plan.hash) throw new Error("");

[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:78:69
-         if (stateHash(current) !== stateHash(before)) throw new Error(`Catalog changed after planning: ${desired.canonicalKey}`);
+         if (stateHash(current) !== stateHash(before)) throw new Error(``);

[NoCoverage] StringLiteral
apps/api/services/chainPilotPlan.ts:88:102
-     if (after.length !== plan.changes.length || stateHash(plan.changes) !== plan.hash) throw new Error("Incomplete catalog rollback evidence");
+     if (after.length !== plan.changes.length || stateHash(plan.changes) !== plan.hash) throw new Error("");

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:9:114
-       : v !== null && typeof v === "object" ? Object.fromEntries(Object.entries(v).sort(([a], [b]) => a < b ? -1 : a > b ? 1 : 0).map(([k, item]) => [k, sorted(item)])) : v;
+       : v !== null && typeof v === "object" ? Object.fromEntries(Object.entries(v).sort(([a], [b]) => a < b ? -1 : false ? 1 : 0).map(([k, item]) => [k, sorted(item)])) : v;
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] EqualityOperator
apps/api/services/chainPilotPlan.ts:9:114
-       : v !== null && typeof v === "object" ? Object.fromEntries(Object.entries(v).sort(([a], [b]) => a < b ? -1 : a > b ? 1 : 0).map(([k, item]) => [k, sorted(item)])) : v;
+       : v !== null && typeof v === "object" ? Object.fromEntries(Object.entries(v).sort(([a], [b]) => a < b ? -1 : a <= b ? 1 : 0).map(([k, item]) => [k, sorted(item)])) : v;
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] StringLiteral
apps/api/services/chainPilotPlan.ts:23:66
-       const found = brands.filter(b => b.slug === slug && ["high", "llm-confirmed"].includes(b.detectionConf ?? "") && b.menuKind === "restaurant");
+       const found = brands.filter(b => b.slug === slug && ["high", ""].includes(b.detectionConf ?? "") && b.menuKind === "restaurant");
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:23:118
-       const found = brands.filter(b => b.slug === slug && ["high", "llm-confirmed"].includes(b.detectionConf ?? "") && b.menuKind === "restaurant");
+       const found = brands.filter(b => b.slug === slug && ["high", "llm-confirmed"].includes(b.detectionConf ?? "") && true);
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:24:9
-       if (found.length !== 1) throw new Error(`Verified brand missing or ambiguous: ${slug}`);
+       if (false) throw new Error(`Verified brand missing or ambiguous: ${slug}`);
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:27:63
-     const find = (id: string, key: string) => catalog.find(r => r.brandId === id && r.canonicalKey === key) ?? null;
+     const find = (id: string, key: string) => catalog.find(r => true && r.canonicalKey === key) ?? null;
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] StringLiteral
apps/api/services/chainPilotPlan.ts:35:54
-       const row: ChainCatalogRow = { id: before?.id ?? `${id}:${definition.canonicalKey}`, brandId: id, canonicalKey: definition.canonicalKey,
+       const row: ChainCatalogRow = { id: before?.id ?? ``, brandId: id, canonicalKey: definition.canonicalKey,
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:39:9
-       if (!approvedChainRow({ ...row, review })) throw new Error(`Invalid reviewed facts: ${definition.canonicalKey}`);
+       if (false) throw new Error(`Invalid reviewed facts: ${definition.canonicalKey}`);
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ArrayDeclaration
apps/api/services/chainPilotPlan.ts:41:65
-         officialUrl: row.officialUrl, aliases: before?.aliases ?? [], review: JSON.parse(JSON.stringify(review)) }, definition.expected);
+         officialUrl: row.officialUrl, aliases: before?.aliases ?? ["Stryker was here"], review: JSON.parse(JSON.stringify(review)) }, definition.expected);
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:45:9
-       if (!before) throw new Error(`Quarantined row missing: ${definition.canonicalKey}`);
+       if (false) throw new Error(`Quarantined row missing: ${definition.canonicalKey}`);
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ArrowFunction
apps/api/services/chainPilotPlan.ts:51:44
-     const replacements = new Set(changes.map(c => `${c.desired.brandId}:${c.desired.canonicalKey}`));
+     const replacements = new Set(changes.map(() => undefined));
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] StringLiteral
apps/api/services/chainPilotPlan.ts:51:49
-     const replacements = new Set(changes.map(c => `${c.desired.brandId}:${c.desired.canonicalKey}`));
+     const replacements = new Set(changes.map(c => ``));
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ArrayDeclaration
apps/api/services/chainPilotPlan.ts:52:36
-     const final: ChainCatalogRow[] = [...catalog.filter(r => !replacements.has(`${r.brandId}:${r.canonicalKey}`)),
-       ...changes.map(c => ({ ...c.desired, id: c.before?.id ?? `${c.desired.brandId}:${c.desired.canonicalKey}` }))];
+     const final: ChainCatalogRow[] = [];
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] MethodExpression
apps/api/services/chainPilotPlan.ts:52:40
-     const final: ChainCatalogRow[] = [...catalog.filter(r => !replacements.has(`${r.brandId}:${r.canonicalKey}`)),
+     const final: ChainCatalogRow[] = [...catalog,
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ArrowFunction
apps/api/services/chainPilotPlan.ts:52:55
-     const final: ChainCatalogRow[] = [...catalog.filter(r => !replacements.has(`${r.brandId}:${r.canonicalKey}`)),
+     const final: ChainCatalogRow[] = [...catalog.filter(() => undefined),
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] BooleanLiteral
apps/api/services/chainPilotPlan.ts:52:60
-     const final: ChainCatalogRow[] = [...catalog.filter(r => !replacements.has(`${r.brandId}:${r.canonicalKey}`)),
+     const final: ChainCatalogRow[] = [...catalog.filter(r => replacements.has(`${r.brandId}:${r.canonicalKey}`)),
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] StringLiteral
apps/api/services/chainPilotPlan.ts:52:78
-     const final: ChainCatalogRow[] = [...catalog.filter(r => !replacements.has(`${r.brandId}:${r.canonicalKey}`)),
+     const final: ChainCatalogRow[] = [...catalog.filter(r => !replacements.has(``)),
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] LogicalOperator
apps/api/services/chainPilotPlan.ts:53:46
-       ...changes.map(c => ({ ...c.desired, id: c.before?.id ?? `${c.desired.brandId}:${c.desired.canonicalKey}` }))];
+       ...changes.map(c => ({ ...c.desired, id: c.before?.id && `${c.desired.brandId}:${c.desired.canonicalKey}` }))];
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] StringLiteral
apps/api/services/chainPilotPlan.ts:53:62
-       ...changes.map(c => ({ ...c.desired, id: c.before?.id ?? `${c.desired.brandId}:${c.desired.canonicalKey}` }))];
+       ...changes.map(c => ({ ...c.desired, id: c.before?.id ?? `` }))];
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:57:9
-       if (!approved) continue;
+       if (true) continue;
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] BlockStatement
apps/api/services/chainPilotPlan.ts:58:50
-       for (const alias of approved.review.aliases) {
-         const item = { name: alias.name, ...(alias.section !== undefined ? { section: alias.section } : {}), ...(alias.description !== undefined ? { description: alias.description } : {}) };
-         if (match(row.brandId, item).status !== "matched") throw new Error(`Ambiguous reviewed alias: ${alias.name}`);
-       }
+       for (const alias of approved.review.aliases) {}
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:59:44
-         const item = { name: alias.name, ...(alias.section !== undefined ? { section: alias.section } : {}), ...(alias.description !== undefined ? { description: alias.description } : {}) };
+         const item = { name: alias.name, ...(true ? { section: alias.section } : {}), ...(alias.description !== undefined ? { description: alias.description } : {}) };
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:60:11
-         if (match(row.brandId, item).status !== "matched") throw new Error(`Ambiguous reviewed alias: ${alias.name}`);
+         if (false) throw new Error(`Ambiguous reviewed alias: ${alias.name}`);
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ObjectLiteral
apps/api/services/chainPilotPlan.ts:70:44
-       const brands = await tx.brand.findMany({ where: { slug: { in: [...new Set([...pilot.changes, ...pilot.quarantine].map(d => d.slug))] } } });
+       const brands = await tx.brand.findMany({});
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ObjectLiteral
apps/api/services/chainPilotPlan.ts:71:65
-       const currentCatalog = await tx.chainItem.findMany({ where: { brandId: { in: brands.map(b => b.id) } } });
+       const currentCatalog = await tx.chainItem.findMany({ where: {} });
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:79:42
-         const data = { ...desired, review: desired.review === null ? Prisma.DbNull : reviewJson(desired.review), retrievedAt: new Date() };
+         const data = { ...desired, review: false ? Prisma.DbNull : reviewJson(desired.review), retrievedAt: new Date() };
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ObjectLiteral
apps/api/services/chainPilotPlan.ts:83:6
-     }, { isolationLevel: Prisma.TransactionIsolationLevel.Serializable, timeout: 30_000 });
+     }, {});
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes
    official PDF pilot correction against captured April data all 64 captured April rows match the actual seven-dish correction set; live UE observations agree
  and 1 more test!

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:88:7
-     if (after.length !== plan.changes.length || stateHash(plan.changes) !== plan.hash) throw new Error("Incomplete catalog rollback evidence");
+     if (false) throw new Error("Incomplete catalog rollback evidence");
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:98:79
-           await tx.chainItem.update({ where: { id }, data: { ...before, review: before.review === null ? Prisma.DbNull : reviewJson(before.review) } });
+           await tx.chainItem.update({ where: { id }, data: { ...before, review: true ? Prisma.DbNull : reviewJson(before.review) } });
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible

[Survived] ConditionalExpression
apps/api/services/chainPilotPlan.ts:98:79
-           await tx.chainItem.update({ where: { id }, data: { ...before, review: before.review === null ? Prisma.DbNull : reviewJson(before.review) } });
+           await tx.chainItem.update({ where: { id }, data: { ...before, review: false ? Prisma.DbNull : reviewJson(before.review) } });
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible

[Survived] EqualityOperator
apps/api/services/chainPilotPlan.ts:98:79
-           await tx.chainItem.update({ where: { id }, data: { ...before, review: before.review === null ? Prisma.DbNull : reviewJson(before.review) } });
+           await tx.chainItem.update({ where: { id }, data: { ...before, review: before.review !== null ? Prisma.DbNull : reviewJson(before.review) } });
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible

[Survived] ObjectLiteral
apps/api/services/chainPilotPlan.ts:101:6
-     }, { isolationLevel: Prisma.TransactionIsolationLevel.Serializable, timeout: 30_000 });
+     }, {});
Tests ran:
    official PDF pilot correction against captured April data 12 catalog corrections are atomic, idempotent after replan, and exactly reversible
    official PDF pilot correction against captured April data stale or altered plans and mismatched rollback records fail without partial writes

[NoCoverage] ObjectLiteral
apps/api/services/chainPilotRollback.ts:14:51
-       if (!prior) await tx.macroEstimate.deleteMany({ where: { menuItemId: after.id, source: "official" } });
+       if (!prior) await tx.macroEstimate.deleteMany({});

[NoCoverage] ObjectLiteral
apps/api/services/chainPilotRollback.ts:14:60
-       if (!prior) await tx.macroEstimate.deleteMany({ where: { menuItemId: after.id, source: "official" } });
+       if (!prior) await tx.macroEstimate.deleteMany({ where: {} });

[NoCoverage] StringLiteral
apps/api/services/chainPilotRollback.ts:14:92
-       if (!prior) await tx.macroEstimate.deleteMany({ where: { menuItemId: after.id, source: "official" } });
+       if (!prior) await tx.macroEstimate.deleteMany({ where: { menuItemId: after.id, source: "" } });

[Survived] ObjectLiteral
apps/api/services/chainPilotRollback.ts:11:115
-       const current = await tx.menuItem.findUnique({ where: { id: after.id }, include: { macroEstimates: { orderBy: { id: "asc" } } } });
+       const current = await tx.menuItem.findUnique({ where: { id: after.id }, include: { macroEstimates: { orderBy: {} } } });
Tests ran:
    official PDF pilot correction against captured April data April rollback restores an existing official estimate and rejects any later item or estimate edit

[Survived] ConditionalExpression
apps/api/services/chainPilotRollback.ts:13:51
-       const prior = before.macroEstimates.find(e => e.source === "official");
+       const prior = before.macroEstimates.find(e => true);
Tests ran:
    official PDF pilot correction against captured April data April rollback restores an existing official estimate and rejects any later item or estimate edit

[Survived] ConditionalExpression
apps/api/services/chainPilotRollback.ts:14:9
-       if (!prior) await tx.macroEstimate.deleteMany({ where: { menuItemId: after.id, source: "official" } });
+       if (false) await tx.macroEstimate.deleteMany({ where: { menuItemId: after.id, source: "official" } });
Tests ran:
    official PDF pilot correction against captured April data April rollback restores an existing official estimate and rejects any later item or estimate edit

[Survived] ConditionalExpression
apps/api/services/chainPilotRollback.ts:16:53
-         const data = { ...prior, ingredientBreakdown: prior.ingredientBreakdown === null ? Prisma.DbNull : prior.ingredientBreakdown as Prisma.InputJsonValue };
+         const data = { ...prior, ingredientBreakdown: false ? Prisma.DbNull : prior.ingredientBreakdown as Prisma.InputJsonValue };
Tests ran:
    official PDF pilot correction against captured April data April rollback restores an existing official estimate and rejects any later item or estimate edit

[Survived] ObjectLiteral
apps/api/services/chainPilotRollback.ts:20:6
-     }, { isolationLevel: Prisma.TransactionIsolationLevel.Serializable, timeout: 30_000 });
+     }, {});
Tests ran:
    official PDF pilot correction against captured April data April rollback restores an existing official estimate and rejects any later item or estimate edit
