[Survived] ConditionalExpression
apps/api/lib/restaurantMenuService.ts:19:37
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && true && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] Regex
apps/api/lib/restaurantMenuService.ts:19:68
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] Regex
apps/api/lib/restaurantMenuService.ts:19:68
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && typeof c.score === "string" && /-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] Regex
apps/api/lib/restaurantMenuService.ts:19:68
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]\d+)?$/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] Regex
apps/api/lib/restaurantMenuService.ts:19:68
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] Regex
apps/api/lib/restaurantMenuService.ts:19:68
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[^+-]?\d+)?$/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] Regex
apps/api/lib/restaurantMenuService.ts:19:68
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d)?$/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] Regex
apps/api/lib/restaurantMenuService.ts:19:68
-       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\d+)?$/i.test(c.score)
+       if (typeof c.id === "string" && typeof c.score === "string" && /^-?\d+(\.\d+)?(e[+-]?\D+)?$/i.test(c.score)
Tests ran:
    menu page SQL through Prisma all items are scored, paged once and paired with the winning metadata
    menu page SQL through Prisma selection, inactive targets, absent restaurants and invalid cursor numbers keep their contracts
    menu page SQL through Prisma cursor context and each numeric/type guard reject with an otherwise valid cursor

[Survived] BooleanLiteral
apps/api/lib/restaurantMenuService.ts:30:19
-       select: { id: true, name: true, rating: true, userRatingCount: true, _count: { select: { menuItems: true } } } });
+       select: { id: false, name: true, rating: true, userRatingCount: true, _count: { select: { menuItems: true } } } });
Tests ran:
    getRestaurantMenu returns null for unknown restaurant
    getRestaurantMenu returns restaurant with menu items — correct shape
    getRestaurantMenu always returns the full, unlocked menu — route layer handles entitlement redaction
  and 9 more tests!
