[Survived] StringLiteral
apps/api/lib/macroScoreSql.ts:10:58
-     return terms.length ? Prisma.sql`(${Prisma.join(terms, " + ")})` : Prisma.sql`0::double precision`;
+     return terms.length ? Prisma.sql`(${Prisma.join(terms, "")})` : Prisma.sql`0::double precision`;
Tests ran:
    findNearbyRestaurants preserves DB row order (DB already applied radius filter + scoring sort)
    findNearbyRestaurants computes matchScore = sqrt(scoreSum) when targets are active
    findNearbyRestaurants perfect match (scoreSum = 0) produces matchScore = 0
  and 2 more tests!

[Survived] StringLiteral
apps/api/lib/macroScoreSql.ts:10:80
-     return terms.length ? Prisma.sql`(${Prisma.join(terms, " + ")})` : Prisma.sql`0::double precision`;
+     return terms.length ? Prisma.sql`(${Prisma.join(terms, " + ")})` : Prisma.sql``;
Tests ran:
    findNearbyRestaurants returns restaurants from the DISTINCT ON query result
    findNearbyRestaurants respects limit — SQL pushes LIMIT down so data and total reflect the bounded result
    findNearbyRestaurants returns distanceMiles rounded to 2 decimal places
  and 15 more tests!

[Survived] MethodExpression
apps/api/lib/macroTargetParams.ts:15:38
-         return n === 0 && /[1-9]/.test(text.trim().split(/e/i)[0]!) ? NaN : n;
+         return n === 0 && /[1-9]/.test(text.split(/e/i)[0]!) ? NaN : n;
Tests ran:
    protein=1e-400 is rejected
    zero means inactive; invalid internal targets never produce an active score

[Survived] ConditionalExpression
packages/shared/src/utils/macroScoring.ts:7:77
-   export const activeTarget = (value: number | undefined): value is number => value !== undefined && Number.isFinite(value) && value > 0;
+   export const activeTarget = (value: number | undefined): value is number => true && Number.isFinite(value) && value > 0;
Tests ran:
    findNearbyRestaurants returns restaurants from the DISTINCT ON query result
    findNearbyRestaurants preserves DB row order (DB already applied radius filter + scoring sort)
    findNearbyRestaurants respects limit — SQL pushes LIMIT down so data and total reflect the bounded result
  and 41 more tests!

[Survived] MethodExpression
packages/shared/src/utils/macroScoring.ts:12:29
-     if (!dimensions.length || dimensions.some(k => !Number.isFinite(macros[k]) || macros[k] < 0)) return null;
+     if (!dimensions.length || dimensions.every(k => !Number.isFinite(macros[k]) || macros[k] < 0)) return null;
Tests ran:
    computeMatchScore happy path returns correct score for all four dimensions
    computeMatchScore happy path returns a non-negative number
    computeMatchScore perfect match returns 0 when item exactly matches all specified targets
  and 9 more tests!
